W8D1/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "very nice post 111"], ["url", "22222"], ["content", "11111"], ["sub_id", 2], ["user_id", 1], ["created_at", "2021-05-03 21:50:42.129561"], ["updated_at", "2021-05-03 21:50:42.129561"]]
---
    def create
        @post = current_user.posts.new(post_params)
        @post.sub_id = params[:sub_id]
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 0], ["LIMIT", 1]]
---
    def show
        @post = current_user.posts.find_by(id: params[:id])