W8D1/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hello World"], ["description", "Have a great day!!"], ["user_id", 1], ["created_at", "2021-05-03 19:06:16.717956"], ["updated_at", "2021-05-03 19:06:16.717956"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = params[:user_id]
        if @sub.save