W10D4/Todo/app/controllers/api/todolists_controller.rb

    def index
        @todos = Todolist.all
---
SELECT "todolists".* FROM "todolists"