W11D2/Pokedex/app/views/api/pokemon/show.json.jbuilder

json.moves do
    @pokemon.moves.each do |move|
---
SELECT "moves".* FROM "moves" INNER JOIN "poke_moves" ON "moves"."id" = "poke_moves"."move_id" WHERE "poke_moves"."pokemon_id" = $1  [["pokemon_id", 5]]

json.items do
    @pokemon.items.each do |item|
---
SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 5]]