W6D4/Art_Share_API/app/controllers/artworks_controller.rb

SELECT "user_id" FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = params[:user_id] OR artwork_shares.viewer_id = params[:user_id])
---
    def index
        if params[:user_id]
            artworks = Artwork
            .joins(:artwork_shares)
            .where("artworks.artist_id = #{params[:user_id]} OR artwork_shares.viewer_id = #{params[:user_id]}")
            render json: artworks

        else
            artworks = Artwork.all