W6D4/Art_Share_API/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            comments = Comment.where("user_id = #{params[:user_id]}")
        else
            comments = Comment.where("artwork_id = #{params[:artwork_id]}")
---
SELECT "comments".* FROM "comments" WHERE (artwork_id = 9)

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("body", "artwork_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Very nice picture"], ["artwork_id", 9], ["user_id", 14], ["created_at", "2021-04-22 21:36:16.931522"], ["updated_at", "2021-04-22 21:36:16.931522"]]