W6D4/Art_Share_API/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username Like ('%1%'))
---
    def index
        if params.has_key?(:name)
            users= User.where('username Like (?)', "%#{params[:name]}%")
        else
        users = User.all