W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "NOT Lucky"], ["email", "notlucky@mail.com"], ["updated_at", "2021-04-21 21:35:00.365598"], ["id", 4]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(params.require(:user).permit(:name, :email))